<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Category;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        Category::create([
            'cat_name' => 'การศึกษาและการพัฒนาทักษะ',
            'cat_ismandatory' => '1',
            'created_by' => '1',
            'description' => 'การจิตอาสาในหมวดหมู่นี้มุ่งเน้นการส่งเสริมและพัฒนาศักยภาพของบุคคลหรือชุมชนผ่านการถ่ายทอดความรู้ ทักษะ หรือประสบการณ์ในด้านต่าง ๆ อาทิ การจัดกิจกรรมส่งเสริมการเรียนรู้ การสอนหนังสือ การอบรมวิชาชีพ หรือการให้คำปรึกษาด้านการศึกษา ทั้งนี้เพื่อเสริมสร้างโอกาสในการพัฒนาตนเองอย่างยั่งยืน และลดความเหลื่อมล้ำทางการศึกษาและทักษะในสังคม',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31'
        ]);
        Category::create([
            'cat_name' => 'การดูแลสุขภาพและสวัสดิการ',
            'cat_ismandatory' => '1',
            'created_by' => '1',
            'description' => 'การทำจิตอาสาที่มุ่งเน้นการส่งเสริมสุขภาพและความเป็นอยู่ที่ดีของบุคคลหรือชุมชน เช่น การให้คำแนะนำเกี่ยวกับการดูแลสุขภาพ การแจกจ่ายยารักษาโรค การให้การช่วยเหลือผู้สูงอายุ หรือการให้การดูแลผู้ป่วยในชุมชน เพื่อลดปัญหาทางสุขภาพและยกระดับคุณภาพชีวิตของผู้รับบริการ',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31'
        ]);
        Category::create([
            'cat_name' => 'การอนุรักษ์และฟื้นฟูสิ่งแวดล้อม',
            'cat_ismandatory' => '1',
            'created_by' => '1',
            'description' => 'การทำจิตอาสาที่เกี่ยวข้องกับการรักษาและฟื้นฟูสิ่งแวดล้อม เช่น การปลูกป่า การเก็บขยะ การรณรงค์ลดการใช้พลาสติก หรือการให้ความรู้เกี่ยวกับการอนุรักษ์ทรัพยากรธรรมชาติ เพื่อสร้างสังคมที่ยั่งยืนและมีความรับผิดชอบต่อสิ่งแวดล้อม',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31'
        ]);
        Category::create([
            'cat_name' => 'การช่วยเหลือผู้ยากไร้และผู้ด้อยโอกาส',
            'cat_ismandatory' => '1',
            'created_by' => '1',
            'description' => 'การทำจิตอาสาที่มุ่งช่วยเหลือและบรรเทาความเดือดร้อนของผู้ด้อยโอกาสและผู้ยากไร้ เช่น การแจกจ่ายอาหารและเสื้อผ้า การสนับสนุนที่พักพิง หรือการให้ความช่วยเหลือด้านการเงินและทรัพยากร เพื่อช่วยเหลือให้ผู้รับสามารถพึ่งพาตนเองได้.',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31'
        ]);
        Category::create([
            'cat_name' => 'การสนับสนุนผู้พิการ',
            'cat_ismandatory' => '1',
            'created_by' => '1',
            'description' => 'การจิตอาสาที่ช่วยเหลือและสนับสนุนบุคคลที่มีความพิการในด้านต่าง ๆ เช่น การให้ความช่วยเหลือทางการเดินทาง การจัดกิจกรรมเพื่อเสริมสร้างทักษะหรือความสามารถ การให้คำปรึกษาทางด้านจิตใจ หรือการสร้างความเข้าใจในสังคมเกี่ยวกับความพิการ',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31'
        ]);
        
    }
}
