<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Category;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // ปี 2025
        Category::create([
            'cat_name' => 'การศึกษาและการพัฒนาทักษะ',
            'cat_ismandatory' => '1',
            'created_by' => '10',
            'description' => 'การทำจิตอาสาในหมวดหมู่นี้มุ่งเน้นการส่งเสริมและพัฒนาศักยภาพของบุคคลหรือชุมชนผ่านการถ่ายทอดความรู้ ทักษะ หรือประสบการณ์ในด้านต่าง ๆ อาทิ การจัดกิจกรรมส่งเสริมการเรียนรู้ การสอนหนังสือ การอบรมวิชาชีพ หรือการให้คำปรึกษาด้านการศึกษา ทั้งนี้เพื่อเสริมสร้างโอกาสในการพัฒนาตนเองอย่างยั่งยืน และลดความเหลื่อมล้ำทางการศึกษาและทักษะในสังคม',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31',
        ]);
        Category::create([
            'cat_name' => 'การดูแลสุขภาพและสวัสดิการ',
            'cat_ismandatory' => '0',
            'created_by' => '10',
            'description' => 'การทำจิตอาสาที่มุ่งเน้นการส่งเสริมสุขภาพและความเป็นอยู่ที่ดีของบุคคลหรือชุมชน เช่น การให้คำแนะนำเกี่ยวกับการดูแลสุขภาพ การแจกจ่ายยารักษาโรค การให้การช่วยเหลือผู้สูงอายุ หรือการให้การดูแลผู้ป่วยในชุมชน เพื่อลดปัญหาทางสุขภาพและยกระดับคุณภาพชีวิตของผู้รับบริการ',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31',
        ]);
        Category::create([
            'cat_name' => 'การอนุรักษ์และฟื้นฟูสิ่งแวดล้อม',
            'cat_ismandatory' => '1',
            'created_by' => '10',
            'description' => 'การทำจิตอาสาที่เกี่ยวข้องกับการรักษาและฟื้นฟูสิ่งแวดล้อม เช่น การปลูกป่า การเก็บขยะ การรณรงค์ลดการใช้พลาสติก หรือการให้ความรู้เกี่ยวกับการอนุรักษ์ทรัพยากรธรรมชาติ เพื่อสร้างสังคมที่ยั่งยืนและมีความรับผิดชอบต่อสิ่งแวดล้อม',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31',
        ]);
        Category::create([
            'cat_name' => 'การช่วยเหลือผู้ยากไร้และผู้ด้อยโอกาส',
            'cat_ismandatory' => '0',
            'created_by' => '11',
            'description' => 'การทำจิตอาสาที่มุ่งช่วยเหลือและบรรเทาความเดือดร้อนของผู้ด้อยโอกาสและผู้ยากไร้ เช่น การแจกจ่ายอาหารและเสื้อผ้า การสนับสนุนที่พักพิง หรือการให้ความช่วยเหลือด้านการเงินและทรัพยากร เพื่อช่วยเหลือให้ผู้รับสามารถพึ่งพาตนเองได้.',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31',
        ]);
        Category::create([
            'cat_name' => 'การส่งเสริมวัฒนธรรมและศิลปะ',
            'cat_ismandatory' => '0',
            'created_by' => '11',
            'description' => 'การทำจิตอาสาที่มุ่งส่งเสริมและอนุรักษ์วัฒนธรรมและศิลปะในชุมชน เช่น การจัดกิจกรรมทางศิลปะ การสอนทักษะด้านศิลปะ การอนุรักษ์ประเพณีและขนบธรรมเนียมต่าง ๆ เพื่อสร้างความภาคภูมิใจและส่งเสริมคุณค่าทางวัฒนธรรม',
            'cat_year_id' => '5',
            'status' => 'pending',
            'expiration_date' => '2026-01-31',
        ]);

        // ปี 2024
        Category::create([
            'cat_name' => 'การอนุรักษ์สิ่งแวดล้อม',
            'cat_ismandatory' => '1',
            'created_by' => '10',
            'description' => 'การทำจิตอาสาในหมวดหมู่นี้มุ่งเน้นการส่งเสริมการอนุรักษ์ ฟื้นฟู และใช้ทรัพยากรธรรมชาติอย่างยั่งยืน ผ่านการดำเนินกิจกรรมที่เป็นประโยชน์ต่อระบบนิเวศ เช่น การปลูกป่า การจัดการขยะอย่างเหมาะสม การอนุรักษ์แหล่งน้ำ การรณรงค์ลดการใช้วัสดุที่ส่งผลกระทบต่อสิ่งแวดล้อม และการเผยแพร่ความรู้เพื่อสร้างความตระหนักและความรับผิดชอบร่วมกันของสังคมในการดูแลรักษาสิ่งแวดล้อมเพื่อความสมดุลและยั่งยืนในระยะยาว',
            'cat_year_id' => '4',
            'status' => 'published',
            'expiration_date' => '2025-01-31',
        ]);
        Category::create([
            'cat_name' => 'การสนับสนุนผู้พิการ',
            'cat_ismandatory' => '0',
            'created_by' => '10',
            'description' => 'การทำจิตอาสาที่ช่วยเหลือและสนับสนุนบุคคลที่มีความพิการในด้านต่าง ๆ เช่น การให้ความช่วยเหลือทางการเดินทาง การจัดกิจกรรมเพื่อเสริมสร้างทักษะหรือความสามารถ การให้คำปรึกษาทางด้านจิตใจ หรือการสร้างความเข้าใจในสังคมเกี่ยวกับความพิการ',
            'cat_year_id' => '4',
            'status' => 'published',
            'expiration_date' => '2025-01-31',
        ]);
        Category::create([
            'cat_name' => 'การพัฒนาสังคมและคุณภาพชีวิต',
            'cat_ismandatory' => '0',
            'created_by' => '11',
            'description' => 'การจิตอาสาที่มุ่งเน้นการยกระดับคุณภาพชีวิตของประชาชนในด้านต่าง ๆ ไม่ว่าจะเป็นสุขภาพ การศึกษา สิ่งแวดล้อม หรือการส่งเสริมสิทธิมนุษยชน ผ่านการมีส่วนร่วมในกิจกรรมเพื่อประโยชน์ส่วนรวม โดยเน้นการสร้างความเข้มแข็งให้แก่ชุมชน การลดความเหลื่อมล้ำ และการส่งเสริมความเท่าเทียมในสังคมอย่างยั่งยืน',
            'cat_year_id' => '4',
            'status' => 'published',
            'expiration_date' => '2025-01-31',
        ]);

        // ปี 2022
        Category::create([
            'cat_name' => 'การสนับสนุนการพัฒนาเด็กและเยาวชน',
            'cat_ismandatory' => '0',
            'created_by' => '11',
            'description' => 'การทำจิตอาสาที่มุ่งเน้นการพัฒนาเด็กและเยาวชน เช่น การจัดกิจกรรมเสริมทักษะชีวิต การส่งเสริมการเรียนรู้ในรูปแบบต่าง ๆ หรือการสร้างโอกาสในการพัฒนาในด้านต่าง ๆ เพื่อเตรียมพร้อมเยาวชนสำหรับการใช้ชีวิตในสังคมอย่างมีคุณภาพ',
            'cat_year_id' => '2',
            'status' => 'published',
            'expiration_date' => '2023-01-31',
        ]);
        Category::create([
            'cat_name' => 'การส่งเสริมการใช้เทคโนโลยี',
            'cat_ismandatory' => '1',
            'created_by' => '11',
            'description' => 'การทำจิตอาสาที่มุ่งส่งเสริมการใช้เทคโนโลยีในด้านต่าง ๆ เช่น การสอนการใช้คอมพิวเตอร์ การสร้างแอปพลิเคชันเพื่อช่วยเหลือสังคม หรือการให้คำแนะนำในการใช้อินเทอร์เน็ตเพื่อเพิ่มโอกาสในการศึกษาและการทำงาน',
            'cat_year_id' => '2',
            'status' => 'published',
            'expiration_date' => '2023-01-31',
        ]);

        // ปี 2021
        Category::create([
            'cat_name' => 'การสนับสนุนการทำเกษตรกรรม',
            'cat_ismandatory' => '0',
            'created_by' => '11',
            'description' => 'การทำจิตอาสาที่เกี่ยวข้องกับการส่งเสริมและสนับสนุนการเกษตรกรรม เช่น การจัดอบรมทักษะการเกษตร การให้คำปรึกษาด้านการเพาะปลูก การสนับสนุนการทำฟาร์มหรือการเกษตรในชุมชน เพื่อช่วยให้เกษตรกรมีความรู้ในการเพิ่มผลผลิตและเสริมสร้างความยั่งยืน',
            'cat_year_id' => '1',
            'status' => 'published',
            'expiration_date' => '2022-01-31',
        ]);
    }
}
